{
    "en": {
      "home": "Home",
      "projects": "Projects",
      "contact": "Contact",
      "review": "Review",
      "slogan": "Your Vision, Our Construction",
      "service1": "Remodeling",
      "service2": "Garage Renovations",
      "service3": "Framing - Drywall",
      "service4": "Insulation & Painting",
      "service5": "ADU's",
      "service6": "New House",
      "projectDescription1": "BL General Construction Inc. is a professional construction company showcased through a clean and informative website that highlights its wide range of services including remodeling, garage renovations, framing, drywall, insulation, painting, ADU construction, and new home builds. The homepage features a bold slogan—“Your Vision, Our Construction”—alongside a sleek logo and an overview of offered services. Visitors can explore a dynamic slideshow of completed projects, giving insight into the company's craftsmanship and attention to detail. The site also includes a detailed contact section with a user-friendly form, making it easy for potential clients to get in touch and request estimates or consultations. Designed with both functionality and visual appeal in mind, the site effectively communicates the company’s commitment to quality and customer satisfaction.",
      "projectDescription2": "Visitors can explore a dynamic slideshow of completed projects, giving insight into the company's craftsmanship and attention to detail. The site includes a detailed contact section with a user-friendly form for estimates and consultations.",
      "contactUs": "Contact Us",
      "firstName": "First Name",
      "lastName": "Last Name",
      "phoneNumber": "Phone Number",
      "descriptionContact": "If you have any questions about scheduling a consultation or estimation, please give us a call or fill in the form.",
      "location": "Location: Salinas, CA",
      "locationMsg": "We proudly serve clients throughout the Bay Area.",
      "email": "Email",
      "message": "Message",
      "sendMessage": "Send Message",
      "leaveReview": "Leave Us a Review",
      "rateUs": "Rate Us",
      "yourName": "Your Name",
      "yourReview": "Your Review",
      "uploadPhoto": "Upload Photo",
      "submitReview": "Submit Review",
      "userReviews": "User Reviews",
      "aboutOwner": "About the Owner",
      "ownerBio": "Leonardo Lopez, the founder and owner of BL General Construction Inc., brings years of hands-on experience..."
    },
    "es": {
      "home": "Inicio",
      "projects": "Proyectos",
      "contact": "Contacto",
      "review": "Opiniones",
      "slogan": "Tu Visión, Nuestra Construcción",
      "service1": "Remodelación",
      "service2": "Renovaciones de Garaje",
      "service3": "Estructuras - Paneles de Yeso",
      "service4": "Aislamiento y Pintura",
      "service5": "ADU's",
      "service6": "Casa Nueva",
      "projectDescription1": "BL General Construction Inc. es una empresa constructora profesional que se presenta a través de un sitio web claro e informativo que destaca su amplia gama de servicios, incluyendo remodelaciones, renovaciones de garajes, enmarcado, paneles de yeso, aislamiento, pintura, construcción de unidades de vivienda adicional (ADU) y construcción de viviendas nuevas. La página de inicio presenta un eslogan llamativo — Su visión, nuestra construcción —, junto con un logotipo elegante y un resumen de los servicios ofrecidos. Los visitantes pueden explorar una presentación dinámica de proyectos completados, que ofrece una visión de la maestría y la atención al detalle de la empresa. El sitio también incluye una sección de contacto detallada con un formulario intuitivo, que facilita a los clientes potenciales contactar y solicitar presupuestos o consultas. Diseñado con la funcionalidad y el atractivo visual en mente, el sitio comunica eficazmente el compromiso de la empresa con la calidad y la satisfacción del cliente.",
      "projectDescription2" : "Los visitantes pueden explorar una presentación dinámica de proyectos completados, que ofrece una visión de la artesanía y la atención al detalle de la empresa. El sitio web incluye una sección de contacto detallada con un formulario intuitivo para solicitar presupuestos y consultas.",
      "contactUs": "Contáctanos",
      "firstName": "Nombre",
      "lastName": "Apellido",
      "phoneNumber": "Número de Teléfono",
      "descriptionContact": "Si tiene alguna pregunta sobre cómo programar una consulta o estimación, llámenos o complete el formulario.",
      "location" : "Ubicación: Salinas, CA",
      "email": "Correo Electrónico",
      "message": "Mensaje",
      "sendMessage": "Enviar Mensaje",
      "leaveReview": "Dejar Reseña",
      "rateUs": "Califícanos",
      "yourName": "Tu Nombre",
      "yourReview": "Tu Reseña",
      "uploadPhoto": "Subir Foto",
      "submitReview": "Enviar Reseña",
      "userReviews": "Reseñas de Usuarios"
    }
  }
  